export default {
    station: {
        //oper

        //model
        stationName: "岗位名称",
        stationNo: "岗位编号",
        corpOrDeptName: "公司/部门",
        corpName: "所属公司",
        deptName: "所在部门",
        employeeName: "员工名称",
        positionName: "职位名称",
        selectionRange: "选择范围",
        hasChildren: "包含子架构岗位",
        higherStation: "上级岗位",
        position: "职位",
        description: "岗位说明",

        
        //msg
        addStationTitle: "新增岗位",
        editStationTitle: "修改岗位",
        browseStationTitle: "查看岗位",
        addStationSuccess: "新增岗位成功",
        editStationSuccess: "修改岗位成功",
        delStationSuccess: "删除岗位成功",
        importStationTitle: "导入企业岗位",
        exportStationTitle: "导出企业岗位",
        stationNameNotBeEmpty: "岗位名称不能为空",

        search: "按岗位名称、岗位编号、部门名称、员工名称、职位名称进行搜索",

        //code
        code: {
            109001: "岗位不存在",
            109002: "已存在一个相同的岗位编号",
            109003: "找不到可修改的岗位",
            109004: "找不到可移除的岗位",
            109005: "岗位已被使用",
            109006: "导入岗位数据失败，导入数据为空",
            109007: "导入岗位数据失败，导入数据列名与模板不一致",
            109008: "导入岗位数据失败，第{0}行所属公司为空",
            109009: "导入岗位数据失败，第{0}行所属公司格式不正确",
            109010: "导入岗位数据失败，第{0}行所属部门为空",
            109011: "导入岗位数据失败，第{0}行所属部门格式不正确",
            109012: "导入岗位数据失败，第{0}行岗位名称为空",
            109013: "导入岗位数据失败，第{0}行岗位名称格式不正确",
            109014: "导入岗位数据失败，第{0}行岗位编号为空",
            109015: "导入岗位数据失败，第{0}行岗位编号格式不正确",
            109016: "导入岗位数据失败，第{0}行岗位编号在当前文档中已经存在",
            109017: "导入岗位数据失败，第{0}行岗位编号在数据库已经存在",
            109018: "导入岗位数据失败，第{0}行上级领导岗位名称格式不正确",
            109019: "导入岗位数据失败，第{0}行上级领导岗位编号格式不正确",
            109020: "导入岗位数据失败，第{0}行职位名称格式不正确",
            109021: "导入岗位数据失败，第{0}行职位名称不存在",
            109022: "导入岗位数据失败，第{0}行所属部门在当前公司下不存在",
            109023: "上级领导岗位不存在",
            109024: "导入岗位数据失败，第{0}行上级领导岗位所属公司不存在",
            109025: "导入岗位数据失败，第{0}行上级领导岗位所属部门在其所属公司下不存在",
            109026: "导入岗位数据失败，第{0}行上级领导岗位不存在"
        }
    }    
}